Loading CIFAR-10 dataset
(50000, 32, 32, 3)
(50000,)
(10000, 32, 32, 3)
(10000,)
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)        2432      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 64)        18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 64)        36928     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 128)         73856     
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 128)         147584    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 4, 4, 256)         295168    
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 4, 4, 256)         590080    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 2, 256)         0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 2, 2, 512)         1180160   
_________________________________________________________________
dropout_5 (Dropout)          (None, 2, 2, 512)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 2, 2, 512)         2359808   
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              525312    
_________________________________________________________________
dropout_7 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800    
_________________________________________________________________
dropout_8 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                5130      
=================================================================
Total params: 5,769,002.0
Trainable params: 5,769,002.0
Non-trainable params: 0.0
_________________________________________________________________
None
Train on 45000 samples, validate on 5000 samples
Epoch 1/25
   80/45000 [..............................] - ETA: 1279s - loss: 2.3023 - acc: 0.0625  320/45000 [..............................] - ETA: 328s - loss: 2.3286 - acc: 0.0781   560/45000 [..............................] - ETA: 192s - loss: 2.3162 - acc: 0.0946  800/45000 [..............................] - ETA: 137s - loss: 2.3121 - acc: 0.0913 1040/45000 [..............................] - ETA: 108s - loss: 2.3108 - acc: 0.0865 1280/45000 [..............................] - ETA: 89s - loss: 2.3102 - acc: 0.0852  1520/45000 [>.............................] - ETA: 77s - loss: 2.3083 - acc: 0.0895 1760/45000 [>.............................] - ETA: 68s - loss: 2.3075 - acc: 0.0960 2000/45000 [>.............................] - ETA: 61s - loss: 2.3070 - acc: 0.0970 2240/45000 [>.............................] - ETA: 55s - loss: 2.3068 - acc: 0.0964 2480/45000 [>.............................] - ETA: 51s - loss: 2.3064 - acc: 0.0968 2720/45000 [>.............................] - ETA: 47s - loss: 2.3061 - acc: 0.0960 2960/45000 [>.............................] - ETA: 44s - loss: 2.3062 - acc: 0.0973 3200/45000 [=>............................] - ETA: 41s - loss: 2.3058 - acc: 0.0994 3440/45000 [=>............................] - ETA: 39s - loss: 2.3056 - acc: 0.1003 3680/45000 [=>............................] - ETA: 37s - loss: 2.3054 - acc: 0.1008 3920/45000 [=>............................] - ETA: 35s - loss: 2.3055 - acc: 0.1000 4160/45000 [=>............................] - ETA: 34s - loss: 2.3054 - acc: 0.0993 4400/45000 [=>............................] - ETA: 32s - loss: 2.3052 - acc: 0.0982 4640/45000 [==>...........................] - ETA: 31s - loss: 2.3052 - acc: 0.0991 4880/45000 [==>...........................] - ETA: 30s - loss: 2.3051 - acc: 0.0982 5120/45000 [==>...........................] - ETA: 29s - loss: 2.3051 - acc: 0.0982 5360/45000 [==>...........................] - ETA: 28s - loss: 2.3050 - acc: 0.0976 5600/45000 [==>...........................] - ETA: 27s - loss: 2.3049 - acc: 0.0984 5840/45000 [==>...........................] - ETA: 26s - loss: 2.3048 - acc: 0.0991 6080/45000 [===>..........................] - ETA: 25s - loss: 2.3047 - acc: 0.1003 6320/45000 [===>..........................] - ETA: 25s - loss: 2.3046 - acc: 0.1013 6560/45000 [===>..........................] - ETA: 24s - loss: 2.3045 - acc: 0.1021 6800/45000 [===>..........................] - ETA: 23s - loss: 2.3044 - acc: 0.1024 7040/45000 [===>..........................] - ETA: 23s - loss: 2.3044 - acc: 0.1023 7280/45000 [===>..........................] - ETA: 22s - loss: 2.3044 - acc: 0.1011 7520/45000 [====>.........................] - ETA: 22s - loss: 2.3042 - acc: 0.1020 7760/45000 [====>.........................] - ETA: 21s - loss: 2.3042 - acc: 0.1014 8000/45000 [====>.........................] - ETA: 21s - loss: 2.3042 - acc: 0.1010 8240/45000 [====>.........................] - ETA: 20s - loss: 2.3042 - acc: 0.1012 8480/45000 [====>.........................] - ETA: 20s - loss: 2.3041 - acc: 0.1014 8720/45000 [====>.........................] - ETA: 20s - loss: 2.3041 - acc: 0.1018 8960/45000 [====>.........................] - ETA: 19s - loss: 2.3041 - acc: 0.1016 9200/45000 [=====>........................] - ETA: 19s - loss: 2.3041 - acc: 0.1015 9440/45000 [=====>........................] - ETA: 18s - loss: 2.3041 - acc: 0.1015 9680/45000 [=====>........................] - ETA: 18s - loss: 2.3040 - acc: 0.1019 9920/45000 [=====>........................] - ETA: 18s - loss: 2.3041 - acc: 0.101810160/45000 [=====>........................] - ETA: 17s - loss: 2.3041 - acc: 0.102310400/45000 [=====>........................] - ETA: 17s - loss: 2.3040 - acc: 0.102310640/45000 [======>.......................] - ETA: 17s - loss: 2.3039 - acc: 0.102310880/45000 [======>.......................] - ETA: 17s - loss: 2.3039 - acc: 0.102811120/45000 [======>.......................] - ETA: 16s - loss: 2.3038 - acc: 0.103411360/45000 [======>.......................] - ETA: 16s - loss: 2.3038 - acc: 0.102811600/45000 [======>.......................] - ETA: 16s - loss: 2.3039 - acc: 0.102311840/45000 [======>.......................] - ETA: 16s - loss: 2.3038 - acc: 0.102012080/45000 [=======>......................] - ETA: 15s - loss: 2.3038 - acc: 0.101612320/45000 [=======>......................] - ETA: 15s - loss: 2.3038 - acc: 0.102112560/45000 [=======>......................] - ETA: 15s - loss: 2.3037 - acc: 0.102212800/45000 [=======>......................] - ETA: 15s - loss: 2.3037 - acc: 0.102913040/45000 [=======>......................] - ETA: 14s - loss: 2.3037 - acc: 0.103113280/45000 [=======>......................] - ETA: 14s - loss: 2.3037 - acc: 0.103313520/45000 [========>.....................] - ETA: 14s - loss: 2.3037 - acc: 0.103013760/45000 [========>.....................] - ETA: 14s - loss: 2.3037 - acc: 0.102714000/45000 [========>.....................] - ETA: 14s - loss: 2.3037 - acc: 0.102714240/45000 [========>.....................] - ETA: 13s - loss: 2.3037 - acc: 0.102414480/45000 [========>.....................] - ETA: 13s - loss: 2.3037 - acc: 0.101514720/45000 [========>.....................] - ETA: 13s - loss: 2.3037 - acc: 0.101614960/45000 [========>.....................] - ETA: 13s - loss: 2.3037 - acc: 0.101615200/45000 [=========>....................] - ETA: 13s - loss: 2.3037 - acc: 0.101615440/45000 [=========>....................] - ETA: 12s - loss: 2.3036 - acc: 0.101915680/45000 [=========>....................] - ETA: 12s - loss: 2.3036 - acc: 0.101315920/45000 [=========>....................] - ETA: 12s - loss: 2.3036 - acc: 0.101616160/45000 [=========>....................] - ETA: 12s - loss: 2.3036 - acc: 0.101716400/45000 [=========>....................] - ETA: 12s - loss: 2.3035 - acc: 0.102016640/45000 [==========>...................] - ETA: 12s - loss: 2.3036 - acc: 0.101616880/45000 [==========>...................] - ETA: 11s - loss: 2.3035 - acc: 0.101817120/45000 [==========>...................] - ETA: 11s - loss: 2.3035 - acc: 0.101817360/45000 [==========>...................] - ETA: 11s - loss: 2.3035 - acc: 0.101817600/45000 [==========>...................] - ETA: 11s - loss: 2.3035 - acc: 0.102017840/45000 [==========>...................] - ETA: 11s - loss: 2.3035 - acc: 0.102218080/45000 [===========>..................] - ETA: 11s - loss: 2.3035 - acc: 0.101818320/45000 [===========>..................] - ETA: 11s - loss: 2.3035 - acc: 0.101618560/45000 [===========>..................] - ETA: 10s - loss: 2.3035 - acc: 0.101418800/45000 [===========>..................] - ETA: 10s - loss: 2.3035 - acc: 0.101419040/45000 [===========>..................] - ETA: 10s - loss: 2.3035 - acc: 0.100919280/45000 [===========>..................] - ETA: 10s - loss: 2.3035 - acc: 0.100719520/45000 [============>.................] - ETA: 10s - loss: 2.3035 - acc: 0.100619760/45000 [============>.................] - ETA: 10s - loss: 2.3034 - acc: 0.100720000/45000 [============>.................] - ETA: 10s - loss: 2.3034 - acc: 0.100520240/45000 [============>.................] - ETA: 9s - loss: 2.3034 - acc: 0.1003 20480/45000 [============>.................] - ETA: 9s - loss: 2.3034 - acc: 0.100520720/45000 [============>.................] - ETA: 9s - loss: 2.3034 - acc: 0.100420960/45000 [============>.................] - ETA: 9s - loss: 2.3034 - acc: 0.100421200/45000 [=============>................] - ETA: 9s - loss: 2.3034 - acc: 0.100721440/45000 [=============>................] - ETA: 9s - loss: 2.3034 - acc: 0.101021680/45000 [=============>................] - ETA: 9s - loss: 2.3034 - acc: 0.100921920/45000 [=============>................] - ETA: 9s - loss: 2.3034 - acc: 0.100922160/45000 [=============>................] - ETA: 8s - loss: 2.3034 - acc: 0.100922400/45000 [=============>................] - ETA: 8s - loss: 2.3033 - acc: 0.101322640/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101622880/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101223120/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101423360/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101623600/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101123840/45000 [==============>...............] - ETA: 8s - loss: 2.3033 - acc: 0.101024080/45000 [===============>..............] - ETA: 8s - loss: 2.3033 - acc: 0.101024320/45000 [===============>..............] - ETA: 7s - loss: 2.3033 - acc: 0.101124560/45000 [===============>..............] - ETA: 7s - loss: 2.3033 - acc: 0.101024800/45000 [===============>..............] - ETA: 7s - loss: 2.3033 - acc: 0.101025040/45000 [===============>..............] - ETA: 7s - loss: 2.3033 - acc: 0.100825280/45000 [===============>..............] - ETA: 7s - loss: 2.3033 - acc: 0.100825520/45000 [================>.............] - ETA: 7s - loss: 2.3033 - acc: 0.100425760/45000 [================>.............] - ETA: 7s - loss: 2.3033 - acc: 0.100626000/45000 [================>.............] - ETA: 7s - loss: 2.3033 - acc: 0.100926240/45000 [================>.............] - ETA: 7s - loss: 2.3033 - acc: 0.100826480/45000 [================>.............] - ETA: 6s - loss: 2.3033 - acc: 0.101026720/45000 [================>.............] - ETA: 6s - loss: 2.3033 - acc: 0.101126960/45000 [================>.............] - ETA: 6s - loss: 2.3033 - acc: 0.100927200/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.100927440/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.101127680/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.101027920/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.101028160/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.101128400/45000 [=================>............] - ETA: 6s - loss: 2.3033 - acc: 0.101228640/45000 [==================>...........] - ETA: 6s - loss: 2.3033 - acc: 0.101428880/45000 [==================>...........] - ETA: 5s - loss: 2.3033 - acc: 0.101529120/45000 [==================>...........] - ETA: 5s - loss: 2.3033 - acc: 0.101529360/45000 [==================>...........] - ETA: 5s - loss: 2.3033 - acc: 0.101229600/45000 [==================>...........] - ETA: 5s - loss: 2.3033 - acc: 0.101329840/45000 [==================>...........] - ETA: 5s - loss: 2.3033 - acc: 0.101330080/45000 [===================>..........] - ETA: 5s - loss: 2.3033 - acc: 0.101230320/45000 [===================>..........] - ETA: 5s - loss: 2.3033 - acc: 0.100930560/45000 [===================>..........] - ETA: 5s - loss: 2.3033 - acc: 0.100930800/45000 [===================>..........] - ETA: 5s - loss: 2.3033 - acc: 0.101031040/45000 [===================>..........] - ETA: 5s - loss: 2.3032 - acc: 0.101031280/45000 [===================>..........] - ETA: 4s - loss: 2.3032 - acc: 0.101031520/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.101031760/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.101032000/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.101032240/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.101132480/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.101132720/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.100832960/45000 [====================>.........] - ETA: 4s - loss: 2.3032 - acc: 0.100733200/45000 [=====================>........] - ETA: 4s - loss: 2.3032 - acc: 0.100533440/45000 [=====================>........] - ETA: 4s - loss: 2.3032 - acc: 0.100433680/45000 [=====================>........] - ETA: 4s - loss: 2.3032 - acc: 0.100433920/45000 [=====================>........] - ETA: 3s - loss: 2.3032 - acc: 0.100634160/45000 [=====================>........] - ETA: 3s - loss: 2.3032 - acc: 0.100534400/45000 [=====================>........] - ETA: 3s - loss: 2.3032 - acc: 0.100634640/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100634880/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100635120/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100435360/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100435600/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100435840/45000 [======================>.......] - ETA: 3s - loss: 2.3032 - acc: 0.100536080/45000 [=======================>......] - ETA: 3s - loss: 2.3032 - acc: 0.100736320/45000 [=======================>......] - ETA: 3s - loss: 2.3032 - acc: 0.100836560/45000 [=======================>......] - ETA: 2s - loss: 2.3032 - acc: 0.100836800/45000 [=======================>......] - ETA: 2s - loss: 2.3032 - acc: 0.100737040/45000 [=======================>......] - ETA: 2s - loss: 2.3032 - acc: 0.100837280/45000 [=======================>......] - ETA: 2s - loss: 2.3032 - acc: 0.100837520/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100737760/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100738000/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100538240/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100338480/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100138720/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100138960/45000 [========================>.....] - ETA: 2s - loss: 2.3032 - acc: 0.100239200/45000 [=========================>....] - ETA: 2s - loss: 2.3032 - acc: 0.100339440/45000 [=========================>....] - ETA: 1s - loss: 2.3032 - acc: 0.100239680/45000 [=========================>....] - ETA: 1s - loss: 2.3031 - acc: 0.100339920/45000 [=========================>....] - ETA: 1s - loss: 2.3032 - acc: 0.100140160/45000 [=========================>....] - ETA: 1s - loss: 2.3031 - acc: 0.100040400/45000 [=========================>....] - ETA: 1s - loss: 2.3031 - acc: 0.100240640/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100240880/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100241120/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100241360/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100341600/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100441840/45000 [==========================>...] - ETA: 1s - loss: 2.3031 - acc: 0.100342080/45000 [===========================>..] - ETA: 1s - loss: 2.3031 - acc: 0.100242320/45000 [===========================>..] - ETA: 0s - loss: 2.3031 - acc: 0.100342560/45000 [===========================>..] - ETA: 0s - loss: 2.3031 - acc: 0.100242800/45000 [===========================>..] - ETA: 0s - loss: 2.3031 - acc: 0.100143040/45000 [===========================>..] - ETA: 0s - loss: 2.3031 - acc: 0.100143280/45000 [===========================>..] - ETA: 0s - loss: 2.3031 - acc: 0.099943520/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099843760/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099744000/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099944240/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099844480/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099744720/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099744960/45000 [============================>.] - ETA: 0s - loss: 2.3031 - acc: 0.099745000/45000 [==============================] - 15s - loss: 2.3031 - acc: 0.0997 - val_loss: 2.3027 - val_acc: 0.0970
Epoch 2/25
   80/45000 [..............................] - ETA: 13s - loss: 2.3014 - acc: 0.1000  320/45000 [..............................] - ETA: 13s - loss: 2.3021 - acc: 0.1000  560/45000 [..............................] - ETA: 13s - loss: 2.3025 - acc: 0.1036  800/45000 [..............................] - ETA: 12s - loss: 2.3026 - acc: 0.1038 1040/45000 [..............................] - ETA: 12s - loss: 2.3024 - acc: 0.0990 1280/45000 [..............................] - ETA: 12s - loss: 2.3025 - acc: 0.0930 1520/45000 [>.............................] - ETA: 12s - loss: 2.3025 - acc: 0.0921 1760/45000 [>.............................] - ETA: 12s - loss: 2.3026 - acc: 0.0943 2000/45000 [>.............................] - ETA: 12s - loss: 2.3027 - acc: 0.0935 2240/45000 [>.............................] - ETA: 12s - loss: 2.3027 - acc: 0.0902 2480/45000 [>.............................] - ETA: 12s - loss: 2.3028 - acc: 0.0895 2720/45000 [>.............................] - ETA: 12s - loss: 2.3028 - acc: 0.0908 2960/45000 [>.............................] - ETA: 12s - loss: 2.3027 - acc: 0.0936 3200/45000 [=>............................] - ETA: 12s - loss: 2.3028 - acc: 0.0928 3440/45000 [=>............................] - ETA: 12s - loss: 2.3027 - acc: 0.0922 3680/45000 [=>............................] - ETA: 12s - loss: 2.3028 - acc: 0.0916 3920/45000 [=>............................] - ETA: 11s - loss: 2.3028 - acc: 0.0908 4160/45000 [=>............................] - ETA: 11s - loss: 2.3027 - acc: 0.0918 4400/45000 [=>............................] - ETA: 11s - loss: 2.3027 - acc: 0.0909 4640/45000 [==>...........................] - ETA: 11s - loss: 2.3028 - acc: 0.0905 4880/45000 [==>...........................] - ETA: 11s - loss: 2.3027 - acc: 0.0918 5120/45000 [==>...........................] - ETA: 11s - loss: 2.3028 - acc: 0.0914 5360/45000 [==>...........................] - ETA: 11s - loss: 2.3028 - acc: 0.0914 5600/45000 [==>...........................] - ETA: 11s - loss: 2.3028 - acc: 0.0938 5840/45000 [==>...........................] - ETA: 11s - loss: 2.3027 - acc: 0.0942 6080/45000 [===>..........................] - ETA: 11s - loss: 2.3028 - acc: 0.0928 6320/45000 [===>..........................] - ETA: 11s - loss: 2.3028 - acc: 0.0922 6560/45000 [===>..........................] - ETA: 11s - loss: 2.3028 - acc: 0.0924 6800/45000 [===>..........................] - ETA: 11s - loss: 2.3027 - acc: 0.0934 7040/45000 [===>..........................] - ETA: 11s - loss: 2.3027 - acc: 0.0929 7280/45000 [===>..........................] - ETA: 10s - loss: 2.3028 - acc: 0.0924 7520/45000 [====>.........................] - ETA: 10s - loss: 2.3028 - acc: 0.0939 7760/45000 [====>.........................] - ETA: 10s - loss: 2.3028 - acc: 0.0936 8000/45000 [====>.........................] - ETA: 10s - loss: 2.3027 - acc: 0.0939 8240/45000 [====>.........................] - ETA: 10s - loss: 2.3027 - acc: 0.0942 8480/45000 [====>.........................] - ETA: 10s - loss: 2.3027 - acc: 0.0948 8720/45000 [====>.........................] - ETA: 10s - loss: 2.3027 - acc: 0.0953 8960/45000 [====>.........................] - ETA: 10s - loss: 2.3027 - acc: 0.0952 9200/45000 [=====>........................] - ETA: 10s - loss: 2.3027 - acc: 0.0952 9440/45000 [=====>........................] - ETA: 10s - loss: 2.3026 - acc: 0.0958 9680/45000 [=====>........................] - ETA: 10s - loss: 2.3026 - acc: 0.0966 9920/45000 [=====>........................] - ETA: 10s - loss: 2.3026 - acc: 0.096410160/45000 [=====>........................] - ETA: 10s - loss: 2.3027 - acc: 0.096810400/45000 [=====>........................] - ETA: 10s - loss: 2.3027 - acc: 0.096610640/45000 [======>.......................] - ETA: 10s - loss: 2.3027 - acc: 0.097110880/45000 [======>.......................] - ETA: 9s - loss: 2.3027 - acc: 0.0975 11120/45000 [======>.......................] - ETA: 9s - loss: 2.3027 - acc: 0.097311360/45000 [======>.......................] - ETA: 9s - loss: 2.3027 - acc: 0.097911600/45000 [======>.......................] - ETA: 9s - loss: 2.3026 - acc: 0.098311840/45000 [======>.......................] - ETA: 9s - loss: 2.3026 - acc: 0.098112080/45000 [=======>......................] - ETA: 9s - loss: 2.3026 - acc: 0.098312320/45000 [=======>......................] - ETA: 9s - loss: 2.3027 - acc: 0.0977