0.9675
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               131200    
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 34        
=================================================================
Total params: 142,098.0
Trainable params: 142,098.0
Non-trainable params: 0.0
_________________________________________________________________
None
Test performance
Loss = 0.1125, acc = 0.9715
0.0
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 32, 32)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 30, 8)             776       
_________________________________________________________________
dropout_4 (Dropout)          (None, 30, 8)             0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 28, 16)            400       
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 14, 16)            0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 12, 32)            1568      
_________________________________________________________________
dropout_5 (Dropout)          (None, 12, 32)            0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 10, 32)            3104      
_________________________________________________________________
global_average_pooling1d_1 ( (None, 32)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_6 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_8 (Dense)              (None, 2)                 34        
=================================================================
Total params: 7,466.0
Trainable params: 7,466.0
Non-trainable params: 0.0
_________________________________________________________________
None
Test performance
Loss = 0.0667, acc = 0.9702
0.0
